swagger/src/Catalogs/Сервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Сервера</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>url</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>variables</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>key</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>enum</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>_description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>default</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

swagger/src/Catalogs/Сервера/Ext/ObjectModule.bsl
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	
	Если ЗначениеЗаполнено(ЭтотОбъект._description) Тогда
		Описание.Вставить("description", ЭтотОбъект._description);
	КонецЕсли;
	
	Описание.Вставить("url", ЭтотОбъект.url);
	
	Если ЭтотОбъект.variables.Количество() > 0 Тогда
		Переменные = Новый Соответствие;
		Для каждого keyValue Из ЭтотОбъект.variables Цикл
			Переменная = Новый Соответствие;
			Переменная.Вставить("default", keyValue.default);
			
			Если ЗначениеЗаполнено(keyValue._description) Тогда
				Переменная.Вставить("description", keyValue._description);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(keyValue.enum) Тогда
				Переменная.Вставить("enum", СтрРазделить(keyValue.enum, ",", Ложь));
			КонецЕсли;
			
			Переменные.Вставить(keyValue.key, Переменная);
		КонецЦикла;
		
		Описание.Вставить("variables", Переменные);
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
